content-org/all-posts.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-20 Mon 14:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Rick Wysocki" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d71cd1">1. <span class="done DONE">DONE</span> AWS and the Enshittification of Educational Workflows</a></li>
</ul>
</div>
</div>
<div id="outline-container-org4d71cd1" class="outline-2">
<h2 id="org4d71cd1"><span class="section-number-2">1.</span> <span class="done DONE">DONE</span> AWS and the Enshittification of Educational Workflows</h2>
<div class="outline-text-2" id="text-1">
<p>
I am currently sitting in my office on campus. It is 1:57PM EST. I had planned a number of things to do today, most of which involved my teaching work: grading, lesson planning for tomorrow, following up with some students, etc. None of that is happening because, as an educational society, we have given up everything to LMS's. And AWS has them down.
</p>

<p>
As a lot of folks are experiencing right now, Amazon Web Services, the infrastructure on a good chunk of the modern web runs, is not working correctly. <a href="https://www.nytimes.com/2025/10/20/business/aws-down-internet-outage.html">The reasons for the outage are unclear</a>, and many websites are back online. Canvas, however&#x2013;the learning management system that universities around the world have partnered with and require teachers to use for essentially all course-related activities&#x2013;remains down.
</p>

<p>
It will be back up soon. My gripe is more with the fact that this is a perfect example of why <a href="file:///posts/2024-10-28-content-management-pedagogy/">content management pedagogy</a> is such an odious phenomenon. The centralized role of learning management systems like Canvas leads to the following issues, for me, today:
</p>

<ul class="org-ul">
<li>I can't access assignments to grade, because students submit them to Canvas.</li>
<li>I can't access or update course materials. They are all required to be on Canvas.</li>
<li>I can't communicate with my students as a whole. Believe it or not, I am fairly certain that there is no actual way for me to message my classes except through Canvas. I could search for their names, one by one, in Outlook (another technology I don't like for another discusison), but guess where my course rosters are?</li>
</ul>

<p>
Cory Doctorow's concept of <a href="https://www.wired.com/story/tiktok-platforms-cory-doctorow/">enshittification</a> refers to a predictable pattern where technologies create value for users, create value for businesses, create value for themselves, and then die because their platform no longer provides any use, enjoyment, or value for anyone. Monopolization he explains, is both a feature and an outcome involved in this process. Once a tool becomes the only game in town, it's free to dominate the contexts in which it's used.
</p>

<p>
Canvas isn't a monopoly, but at a broader scale LMS's have monopolized education. I often ask my students: do you all even like learning management systems like LMS's? Not one student has ever indicated anything positive about them.
</p>

<p>
Yet, we still have to use them, because all schools (not just universities) in the US have ceded educational ground to them, feeding them money and <a href="https://dl.acm.org/doi/10.1145/3613904.3642914">almost certainly student data</a>, becoming more and more reliant on enormous tech companies in ways that are honestly divergent from the goals of education. I suppose it's too much to ask at this current moment when every educational institution is scrambling to make deals with artificial AI companies that are, themselves, experiencing huge economic disruption and a growing sense that <a href="https://www.wsj.com/tech/ai/ai-bubble-building-spree-55ee6128">the bubble will soon burst</a> but&#x2026; I wish we could take the long-term view that <a href="file:///posts/2024-09-25-cannon-shot-epistemology/">digital technologies change over time</a>, often for the worse, into account. If not, we risk enshittifying education itself.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rick Wysocki</p>
<p class="date">Created: 2025-10-20 Mon 14:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
